# Dump the Mock Data into the playgroup space

Thank to [yugabyte](https://docs.yugabyte.com/preview/sample-data/pgexercises/) for this long life learning mocking data

first I need to load the sql so I can use the raw sql for entire learning

In [34]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [38]:
%sql postgresql://postgres:postgres@localhost:5432/mock_university

Connecting and switching to connection postgresql://postgres:postgres@localhost:5432/mock_university

# There will be 3 table

- bookings
- member
- facilities

## Size for each table

In [51]:
%%sql postgresql://postgres:postgres@localhost:5432/mock_university
SELECT 
    ( select count(*) from members ) as member_count,
    ( select count(*) from facilities ) as facilities_count,
    ( select count(*) from bookings ) as booking_count

Connecting and switching to connection postgresql://postgres:postgres@localhost:5432/mock_university

1 rows affected.

+--------------+------------------+---------------+
| member_count | facilities_count | booking_count |
+--------------+------------------+---------------+
|      31      |        9         |      4044     |
+--------------+------------------+---------------+

---

## Members Tables

In [43]:
%%sql postgresql://postgres:postgres@localhost:5432/mock_university
SELECT column_name, data_type
FROM information_schema.columns
WHERE table_schema = 'public' AND table_name = 'members';

Connecting and switching to connection postgresql://postgres:postgres@localhost:5432/mock_university

8 rows affected.

+---------------+-----------------------------+
|  column_name  |          data_type          |
+---------------+-----------------------------+
|     memid     |           integer           |
|    surname    |      character varying      |
|   firstname   |      character varying      |
|    address    |      character varying      |
|    zipcode    |           integer           |
|   telephone   |      character varying      |
| recommendedby |           integer           |
|    joindate   | timestamp without time zone |
+---------------+-----------------------------+

### Sample Data

In [47]:
%sql select * from members limit 10;

Running query in 'postgresql://postgres:***@localhost:5432/mock_university'

10 rows affected.

+-------+----------+-----------+------------------------------------+---------+----------------+---------------+---------------------+
| memid | surname  | firstname |              address               | zipcode |   telephone    | recommendedby |       joindate      |
+-------+----------+-----------+------------------------------------+---------+----------------+---------------+---------------------+
|   0   |  GUEST   |   GUEST   |               GUEST                |    0    | (000) 000-0000 |      None     | 2012-07-01 00:00:00 |
|   1   |  Smith   |   Darren  |     8 Bloomsbury Close, Boston     |   4321  |  555-555-5555  |      None     | 2012-07-02 12:02:05 |
|   2   |  Smith   |   Tracy   |    8 Bloomsbury Close, New York    |   4321  |  555-555-5555  |      None     | 2012-07-02 12:08:23 |
|   3   |  Rownam  |    Tim    |       23 Highway Way, Boston       |  23423  | (844) 693-0723 |      None     | 2012-07-03 09:32:15 |
|   4   | Joplette |   Janice  |     20 Crossing Road, New York     |   234   | (833) 942-4710 |       1       | 2012-07-03 10:25:05 |
|   5   | Butters  |   Gerald  |   1065 Huntingdon Avenue, Boston   |  56754  | (844) 078-4130 |       1       | 2012-07-09 10:44:09 |
|   6   |  Tracy   |   Burton  |      3 Tunisia Drive, Boston       |  45678  | (822) 354-9973 |      None     | 2012-07-15 08:52:55 |
|   7   |   Dare   |   Nancy   |    6 Hunting Lodge Way, Boston     |  10383  | (833) 776-4001 |       4       | 2012-07-25 08:59:12 |
|   8   |  Boothe  |    Tim    | 3 Bloomsbury Close, Reading, 00234 |   234   | (811) 433-2547 |       3       | 2012-07-25 16:02:35 |
|   9   | Stibbons |   Ponder  |     5 Dragons Way, Winchester      |  87630  | (833) 160-3900 |       6       | 2012-07-25 17:09:05 |
+-------+----------+-----------+------------------------------------+---------+----------------+---------------+---------------------+
Truncated to displaylimit of 10.

---

## Facilities Tables

In [45]:
%%sql postgresql://postgres:postgres@localhost:5432/mock_university
SELECT column_name, data_type
FROM information_schema.columns
WHERE table_schema = 'public' AND table_name = 'facilities';

Connecting and switching to connection postgresql://postgres:postgres@localhost:5432/mock_university

6 rows affected.

+--------------------+-------------------+
|    column_name     |     data_type     |
+--------------------+-------------------+
|       facid        |      integer      |
|        name        | character varying |
|     membercost     |      numeric      |
|     guestcost      |      numeric      |
|   initialoutlay    |      numeric      |
| monthlymaintenance |      numeric      |
+--------------------+-------------------+

### Sample Data

In [48]:
%sql select * from facilities limit 10;

Running query in 'postgresql://postgres:***@localhost:5432/mock_university'

9 rows affected.

+-------+-----------------+------------+-----------+---------------+--------------------+
| facid |       name      | membercost | guestcost | initialoutlay | monthlymaintenance |
+-------+-----------------+------------+-----------+---------------+--------------------+
|   0   |  Tennis Court 1 |     5      |     25    |     10000     |        200         |
|   1   |  Tennis Court 2 |     5      |     25    |      8000     |        200         |
|   2   | Badminton Court |     0      |    15.5   |      4000     |         50         |
|   3   |   Table Tennis  |     0      |     5     |      320      |         10         |
|   4   |  Massage Room 1 |     35     |     80    |      4000     |        3000        |
|   5   |  Massage Room 2 |     35     |     80    |      4000     |        3000        |
|   6   |   Squash Court  |    3.5     |    17.5   |      5000     |         80         |
|   7   |  Snooker Table  |     0      |     5     |      450      |         15         |
|   8   |    Pool Table   |     0      |     5     |      400      |         15         |
+-------+-----------------+------------+-----------+---------------+--------------------+

---

## Booking tables

In [42]:
%%sql postgresql://postgres:postgres@localhost:5432/mock_university
SELECT column_name, data_type
FROM information_schema.columns
WHERE table_schema = 'public' AND table_name = 'bookings';

Connecting and switching to connection postgresql://postgres:postgres@localhost:5432/mock_university

5 rows affected.

+-------------+-----------------------------+
| column_name |          data_type          |
+-------------+-----------------------------+
|    bookid   |           integer           |
|    facid    |           integer           |
|    memid    |           integer           |
|  starttime  | timestamp without time zone |
|    slots    |           integer           |
+-------------+-----------------------------+

### Sample Data

In [46]:
%sql select * from bookings limit 10;

Running query in 'postgresql://postgres:***@localhost:5432/mock_university'

10 rows affected.

+--------+-------+-------+---------------------+-------+
| bookid | facid | memid |      starttime      | slots |
+--------+-------+-------+---------------------+-------+
|   0    |   3   |   1   | 2012-07-03 11:00:00 |   2   |
|   1    |   4   |   1   | 2012-07-03 08:00:00 |   2   |
|   2    |   6   |   0   | 2012-07-03 18:00:00 |   2   |
|   3    |   7   |   1   | 2012-07-03 19:00:00 |   2   |
|   4    |   8   |   1   | 2012-07-03 10:00:00 |   1   |
|   5    |   8   |   1   | 2012-07-03 15:00:00 |   1   |
|   6    |   0   |   2   | 2012-07-04 09:00:00 |   3   |
|   7    |   0   |   2   | 2012-07-04 15:00:00 |   3   |
|   8    |   4   |   3   | 2012-07-04 13:30:00 |   2   |
|   9    |   4   |   0   | 2012-07-04 15:00:00 |   2   |
+--------+-------+-------+---------------------+-------+
Truncated to displaylimit of 10.

---